import java.util.ArrayList;

public class TaskManager {
   static ArrayList<Task> allTasks = new ArrayList();


// методы

    // 1. хранить задачи всех типов

    // 2. Методы для каждого из типа задач(Задача/Эпик/Подзадача):

            //  a. Получение списка всех задач

            // b. Удаление всех задач

            // c. Получение по идентификатору

            // d. Создание. Сам объект должен передаваться в качестве параметра

            // e. Обновление. Новая версия объекта с верным идентификатором передаётся в виде параметра

            //  f. Удаление по идентификатору

    // 3.Дополнительные методы:

            // a. Получение списка всех подзадач определённого эпика






}
